import os
import re
import time
import string
import random
import shutil
import numpy as np
import subprocess as sp
from selenium import webdriver
from selenium.common.exceptions import NoSuchElementException
from selenium.webdriver.support.ui import WebDriverWait
from selenium.webdriver.support import expected_conditions as EC
from selenium.webdriver.common.by import By
from PIL import Image
from PIL import ImageEnhance

random.seed(1024)

os.environ["TESSDATA_PREFIX"] = os.path.join(os.getcwd(), "tesseract-4.0.0-alpha")



def orc(img, tesseract=os.path.join(os.getcwd(), 'tesseract-4.0.0-alpha/tesseract.exe')):
    # 识别简单验证码
    if isinstance(img, str):
        img = Image.open(img)
    gray = img.convert('L')
    contrast = ImageEnhance.Contrast(gray)
    ctgray = contrast.enhance(3.0)
    bw = ctgray.point(lambda x: 0 if x < 1 else 255)
    bw.save('captcha_threasholded.png')
    process = sp.Popen(
        [tesseract, 'captcha_threasholded.png', 'out', '--psm 7', '--tessdata-dir ' + os.path.dirname(tesseract)],
        shell=True
    )
    process.wait()
    with open('out.txt', 'r') as f:
        words = ''.join(list(f.readlines())).rstrip()
    words = ''.join(c for c in words if c in string.ascii_letters + string.digits).lower()
    return words


def get_search_result_number(driver):
    # 返回总搜索结果
    driver.switch_to.default_content()
    driver.switch_to_frame('iframeResult')
    pagenumberspan = WebDriverWait(driver, 5).until(
        EC.presence_of_element_located((By.CLASS_NAME, 'pagerTitleCell'))
    )
    pn = pagenumberspan.get_attribute('innerHTML').split('&nbsp')[2].replace(';', '').replace(',', '')
    driver.switch_to.default_content()
    return pn


def get_info(driver, header=''):
    # 下载页面显示的表格结果
    timere = re.compile('[0-9]{4}-[0-9]{1,2}-[0-9]{1,2} [0-9]{1,2}:[0-9]{1,2}')
    driver.switch_to.default_content()
    driver.switch_to_frame('iframeResult')
    time.sleep(1)
    gtc = WebDriverWait(driver, 6).until(
        EC.presence_of_element_located((By.CLASS_NAME, 'GridTableContent'))
    )
    trs = gtc.find_elements_by_tag_name('tr')
    tabletext = list()
    tabletext.append( ' '.join(['序号', trs[0].text]).replace(' ', '\t'))
    for x in trs[1:]:
        text = x.text
        times = timere.findall(text)  # 找到 2017-08-14 14:08 时间中的空格并替换为下划线
        if len(times) > 0:
            for tx in times:
                text = text.replace(tx, tx.replace(' ', '_'))
        text = text.replace('; ', ';')
        tabletext.append(text.replace(' ', '\t'))  # 把空格替换为 \t
    driver.switch_to.default_content()
    return tabletext


def next_page(driver):
    # 搜索结果的下一页，如果有下一页则跳转到下一页，并返回 True，如果没有下一页则返回 False
    driver.switch_to.default_content()
    driver.switch_to_frame('iframeResult')
    driver.execute_script('document.body.scrollIntoView()')  # 滚动屏幕到按钮所在位置
    try:
        next_page = driver.find_element_by_id('Page_next')
        next_page.click()
    except NoSuchElementException:
        next_page = None
    finally:
        driver.switch_to.default_content()
        driver.execute_script('document.body.scrollIntoView()')  # 滚动屏幕到最上层
    if next_page is None:
        return False
    else:
        return True


def checkcode(driver):
    driver.switch_to.default_content()
    driver.switch_to_frame('iframeResult')
    driver.execute_script('document.body.scrollIntoView()')  # 滚动屏幕到按钮所在位置
    try:
        driver.find_element_by_id('CheckCodeImg')
    except NoSuchElementException:
        driver.switch_to.default_content()
        driver.execute_script('document.body.scrollIntoView()')
        return False
    try:
        while driver.find_element_by_tag_name('label').text == '请输入验证码：':
            checkcode_img = driver.find_element_by_id('CheckCodeImg')
            checkcode_img.click()
            checkcode_img.screenshot('checkcode.png')
            captcha = orc('checkcode.png')
            time.sleep(random.randint(1,3))
            captcha_entry = driver.find_element_by_id('CheckCode')
            driver.execute_script('arguments[0].value = arguments[1]', captcha_entry, captcha)
            captch_submit = driver.find_elements_by_tag_name('input')[1]
            captch_submit.click()
    except NoSuchElementException:
        driver.switch_to.default_content()
        driver.execute_script('document.body.scrollIntoView()')  # 滚动屏幕到最上层
        return True


def select_items(driver):
    # 选择当前的条目
    driver.switch_to.default_content()
    driver.switch_to_frame('iframeResult')
    driver.execute_script('document.body.scrollIntoView()')  # 滚动屏幕到按钮所在位置
    selectbox = driver.find_element_by_id('selectCheckbox')  # 获得选择框
    selectbox.click()
    driver.switch_to.default_content()
    driver.execute_script('document.body.scrollIntoView()')  # 滚动屏幕到最上层


def clear_items(driver):
    driver.switch_to.default_content()
    driver.switch_to_frame('iframeResult')
    driver.execute_script('document.body.scrollIntoView()')  # 滚动屏幕到按钮所在位置
    clear = driver.find_element_by_class_name('pageBar_top').find_element_by_class_name('zero')
    clear.click()
    driver.switch_to.default_content()
    driver.execute_script('document.body.scrollIntoView()')  # 滚动屏幕到最上层


def export_items(driver, waittime):
    # 下载选择的文件
    driver.switch_to.default_content()
    driver.switch_to_frame('iframeResult')
    driver.execute_script('document.body.scrollIntoView()')  # 滚动屏幕到按钮所在位置
    driver.find_element_by_class_name('SavePoint').find_element_by_xpath('//a[text()=" 导出/参考文献"]').click()
    # 打开下载页面
    window_ids = driver.window_handles  # 获取所有页面卡 ID
    driver.switch_to.window(window_ids[1])  # 切换到下载页面
    savinglist = WebDriverWait(driver, 10).until(
        EC.presence_of_element_located((By.ID, 'SaveTypeList'))
    )
    savinglist.find_elements_by_tag_name('li')[-1].click()  # 点击自定义选项
    checktable = driver.find_element_by_class_name('checkTable')  # 选项表
    checkall = checktable.find_element_by_class_name('btnTd').find_elements_by_tag_name('input')[0]  # 全选
    checkall.click()
    exportbtn = driver.find_element_by_id('exportExcel')  # 导出按钮
    exportbtn.click()
    time.sleep(waittime)
    driver.close()  # 关闭文件下载页面
    driver.switch_to.window(window_ids[0])  # 返回原页面
    driver.switch_to.default_content()
    driver.execute_script('document.body.scrollIntoView()')  # 滚动屏幕到最上层


def crawler(collage_name, year_start, year_end, subject_id_list, subsubstart):
    subject_name = {
        'A001': '自然科学理论与方法', 'A002': '数学', 'A003': '非线性科学与系统科学', 'A004': '力学',
        'A005': '物理学', 'A006': '生物学', 'A007': '天文学', 'A008': '自然地理学和测绘学', 'A009': '气象学',
        'A010': '海洋学', 'A011': '地质学', 'A012': '地球物理学', 'A013': '资源科学',
        'B014': '化学', 'B015': '无机化工', 'B016': '有机化工', 'B017': '燃料化工', 'B018': '一般化学工业',
        'B019': '石油天然气工业', 'B020': '材料科学', 'B021': '矿业工程', 'B022': '金属学及金属工艺',
        'B023': '冶金工业', 'B024': '轻工业手工业', 'B025': '一般服务业', 'B026': '安全科学与灾害防治',
        'B027': '环境科学与资源利用',
        'C028': '工业通用技术及设备', 'C029': '机械工业', 'C030': '仪器仪表工业', 'C031': '航空航天科学与工程',
        'C032': '武器工业与军事技术', 'C033': '铁路运输', 'C034': '公路与水路运输', 'C035': '汽车工业',
        'C036': '船舶工业', 'C037': '水利水电工程', 'C038': '建筑科学与工程', 'C039': '动力工程', 'C040': '核科学技术',
        'C041': '新能源', 'C042': '电力工业',
        'D043': '农业基础科学', 'D044': '农业工程', 'D045': '农艺学', 'D046': '植物保护', 'D047': '农作物', 'D048': '园艺',
        'D049': '林业', 'D050': '畜牧与动物医学', 'D051': '蚕蜂与野生动物保护', 'D052': '水产和渔业',
        'E053': '医药卫生方针政策与法律法规研究', 'E054': '医学教育与医学边缘学科', 'E055': '预防医学与卫生学',
        'E056': '中医学', 'E057': '中药学', 'E058': '中西医结合', 'E059': '基础医学', 'E060': '临床医学',
        'E061': '感染性疾病及传染病', 'E062': '心血管系统疾病', 'E063': '呼吸系统疾病', 'E064': '消化系统疾病',
        'E065': '内分泌腺及全身性疾病', 'E066': '外科学', 'E067': '泌尿科学', 'E068': '妇产科学', 'E069': '儿科学',
        'E070': '神经病学', 'E071': '精神病学', 'E072': '肿瘤学', 'E073': '眼科与耳鼻咽喉科', 'E074': '口腔科学',
        'E075': '皮肤病与性病', 'E076': '特种医学', 'E077': '急救医学', 'E078': '军事医学与卫生', 'E079': '药学',
        'E080': '生物医学工程',
        'F081': '文艺理论', 'F082': '世界文学', 'F083': '中国文学', 'F084': '中国语言文字', 'F085': '外国语言文字',
        'F086': '音乐舞蹈', 'F087': '戏剧电影与电视艺术', 'F088': '美术书法雕塑与摄影', 'F089': '地理',
        'F090': '文化', 'F091': '史学理论', 'F092': '世界历史', 'F093': '中国通史', 'F094': '中国民族与地方史志',
        'F095': '中国古代史', 'F096': '中国近现代史', 'F097': '考古', 'F098': '人物传记', 'F099': '哲学',
        'F100': '逻辑学', 'F101': '伦理学', 'F102': '心理学', 'F103': '美学', 'F104': '宗教',
        'G105': '马克思主义', 'G106': '中国共产党', 'G107': '政治学', 'G108': '中国政治与国际政治', 'G109': '思想政治教育',
        'G110': '行政学及国家行政管理', 'G111': '政党及群众组织', 'G112': '军事', 'G113': '公安', 'G114': '法理、法史',
        'G115': '宪法', 'G116': '行政法及地方法制', 'G117': '民商法', 'G118': '刑法', 'G119': '经济法',
        'G120': '诉讼法与司法制度', 'G121': '国际法',
        'H122': '社会科学理论与方法', 'H123': '社会学及统计学', 'H124': '民族学', 'H125': '人口学与计划生育',
        'H126': '人才学与劳动科学', 'H127': '教育理论与教育管理', 'H128': '学前教育', 'H129': '初等教育', 'H130': '中等教育',
        'H131': '高等教育', 'H132': '职业教育', 'H133': '成人教育与特殊教育', 'H134': '体育',
        'I135': '无线电电子学', 'I136': '电信技术', 'I137': '计算机硬件技术', 'I138': '计算机软件及计算机应用',
        'I139': '互联网技术', 'I140': '自动化技术', 'I141': '新闻与传媒', 'I142': '出版', 'I143': '图书情报与数字图书馆',
        'I144': '档案及博物馆',
        'J145': '宏观经济管理与可持续发展', 'J146': '经济理论及经济思想史', 'J147': '经济体制改革', 'J148': '经济统计',
        'J149': '农业经济', 'J150': '工业经济', 'J151': '交通运输经济', 'J152': '企业经济', 'J153': '旅游',
        'J154': '文化经济', 'J155': '信息经济与邮政经济', 'J156': '服务业经济', 'J157': '贸易经济', 'J158': '财政与税收',
        'J159': '金融', 'J160': '证券', 'J161': '保险', 'J162': '投资', 'J163': '会计', 'J164': '审计',
        'J165': '市场研究与信息', 'J166': '管理学', 'J167': '领导学与决策学', 'J168': '科学研究管理'
    }
    subsubject_name = {
        'A001_1': '自然科学研究的方针政策', 'A001_2': '自然科学理论与方法论', 'A001_3': '自然科学现状及发展',
        'A001_4': '自然科学研究及自然科学史',
        'A002_1': '数学概论', 'A002_2': '古典数学', 'A002_3': '初、高等数学',
        'A002_4': '数理逻辑、数学基础', 'A002_5': '代数、数论、组合理论', 'A002_6': '数学分析',
        'A002_7': '几何、拓扑', 'A002_8': '动力系统理论', 'A002_9': '概率论 、数理统计', 'A002_A': '运筹学',
        'A002_B': '控制论、信息论(数学理论)', 'A002_C': '计算数学', 'A002_D': '应用数学',
        'A003_1': '非线性科学', 'A003_2': '系统科学',
        'A004_1': '力学概论', 'A004_2': '理论力学(一般力学)', 'A004_3': '振动理论', 'A004_4': '连续介质力学(变形体力学)',
        'A004_5': '固体力学', 'A004_6': '流体力学', 'A004_7': '流变学', 'A004_8': '爆炸力学', 'A004_9': '应用力学',
        'A005_1': '物理学总论', 'A005_2': '物理学现状、概况', 'A005_3': '物理学实验方法与设备', 'A005_4': '物理测量',
        'A005_5': '理论物理学', 'A005_6': '声学', 'A005_7': '光学', 'A005_8': '电磁学、电动力学', 'A005_9': '无线电物理学',
        'A005_A': '真空电子学(电子物理学)', 'A005_B': '半导体物理学', 'A005_C': '固体物理学', 'A005_D': '低温物理学',
        'A005_E': '高压与高温物理学', 'A005_F': '等离子体物理学', 'A005_G': '热学与物质分子运动论',
        'A005_H': '分子物理学、原子物理学', 'A005_I': '原子核物理学、高能物理学', 'A005_J': '应用物理学',
        'A006_1': '生物科学总论', 'A006_2': '普通生物学', 'A006_3': '细胞学', 'A006_4': '遗传学', 'A006_5': '生理学',
        'A006_6': '生物化学', 'A006_7': '生物物理学', 'A006_8': '分子生物学及遗传工程', 'A006_9': '生物工程学',
        'A006_A': '环境生物学', 'A006_B': '古生物学', 'A006_C': '微生物学理论及其应用', 'A006_D': '植物学',
        'A006_E': '动物学', 'A006_F': '昆虫学', 'A006_G': '人类学',
        'A007_1': '一般性问题', 'A007_2': '天文观测设备与观测资料', 'A007_3': '天体测量学', 'A007_4': '天体力学(理论天文学)',
        'A007_5': '天体物理学', 'A007_6': '恒星天文学、星系天文学、宇宙学', 'A007_7': '射电天文学(无线电天文学)',
        'A007_8': '空间天文学', 'A007_9': '太阳系', 'A007_A': '时间、历法',
        'A008_1': '自然地理学', 'A008_2': '测绘学',
        'A009_1': '气象工作及气象经济', 'A009_2': '气象基础科学', 'A009_3': '大气探测(气象观测)', 'A009_4': '气象要素及大气现象',
        'A009_5': '动力气象学', 'A009_6': '天气学', 'A009_7': '天气预报', 'A009_8': '气候学', 'A009_9': '气象灾害学',
        'A009_A': '应用气象学', 'A009_B': '气象设备仪器制造、使用', 'A009_C': '人工影响天气',
        'A010_1': '海洋学', 'A010_2': '海洋调查技术方法与设备', 'A010_3': '区域海洋学', 'A010_4': '海洋气象学',
        'A010_5': '海洋水文学', 'A010_6': '海洋物理学', 'A010_7': '海洋化学', 'A010_8': '海洋生物学', 'A010_9': '海洋地球物理学',
        'A010_A': '海洋地质学、海洋地貌学', 'A010_B': '海洋资源与开发', 'A010_C': '海洋工程', 'A010_D': '海洋环境及海洋保护学',
        'A010_E': '海洋灾害',
        'A011_1': '地质工作及地质经济', 'A011_2': '地质灾害及灾害地质学', 'A011_3': '矿物学', 'A011_4': '岩石学',
        'A011_5': '古生物学', 'A011_6': '历史地质学、地层学', 'A011_7': '动力地质学', 'A011_8': '构造地质学',
        'A011_9': '地质力学', 'A011_A': '区域地质学', 'A011_B': '矿床学', 'A011_C': '地球化学', 'A011_D': '普查勘探地质学',
        'A011_E': '勘探工程学', 'A011_F': '宇宙地质学', 'A011_G': '海洋地质学', 'A011_H': '水文地质学与工程地质学',
        'A011_I': '环境地质学', 'A011_K': '地质勘查仪器及设备',
        'A012_1': '一般理论', 'A012_2': '地球起源及演化', 'A012_3': '地球形状学及地球结构', 'A012_4': '地球重力学',
        'A012_5': '大地构造物理学、岩组学(构造岩石学)', 'A012_6': '地热学、火山学', 'A012_7': '地磁学',
        'A012_8': '地电学', 'A012_9': '水文学', 'A012_A': '空间物理', 'A012_B': '地震地球物理学', 'A012_C': '勘查地球物理学',
        'A012_D': '海洋地球物理学', 'A012_E': '工程及水文地球物理勘探', 'A012_F': '地球物理勘测仪器',
        'A013_1': '资源管理与利用', 'A013_2': '各种资源的开发与利用',
        'B014_1': '总论', 'B014_2': '无机化学', 'B014_3': '有机化学', 'B014_4': '高分子化学(高聚物)',
        'B014_5': '物理化学(理论化学)、化学物理学', 'B014_6': '分析化学', 'B014_7': '应用化学', 'B014_8': '晶体学',
        'B015_1': '无机化学', 'B015_2': '化学工业一般性问题', 'B015_3': '基本无机化学工业',
        'B015_4': '非金属元素及其无机化合物化学工业', 'B015_5': '金属元素的无机化合物化学工业', 'B015_6': '电化学工业',
        'B015_7': '电热工业、高温制品工业', 'B015_8': '硅酸盐工业',
        'B016_1': '有机化学、高分子化学', 'B016_2': '化学工业一般性问题', 'B016_3': '基本有机化学工业',
        'B016_4': '高分子化合物工业(高聚物工业)', 'B016_5': '溶剂、增塑剂、试剂与纯化学品的生产', 'B016_6': '胶粘剂工业',
        'B016_7': '化学肥料工业、农药工业', 'B016_8': '制药化学工业',
        'B017_1': '燃料化学工业', 'B017_2': '炼焦化学工业', 'B017_3': '煤化学及煤的加工利用', 'B017_4': '煤炭气化工业',
        'B017_5': '燃料照明工业', 'B017_6': '爆炸物工业、火柴工业', 'B017_7': '石油、天然气化学工业',
        'B018_1': '染料及颜料工业', 'B018_2': '涂料工业', 'B018_3': '油脂和蜡的化学加工工业、肥皂工业',
        'B018_4': '香料及化妆品工业', 'B018_5': '感光材料工业', 'B018_6': '磁性记录材料工业',
        'B018_7': '农产物化学加工、发酵工业 、蛋白质(朊)化学加工业 、鞣料工业',
        'B019_1': '总论', 'B019_2': '石油勘探与开采工程', 'B019_3': '油气加工工程', 'B019_4': '油气储运工程',
        'B019_5': '油气工程环境保护与综合利用', 'B019_6': '油气机械设备的腐蚀与防护',
        'B020_1': '材料科学基础', 'B020_2': '金属材料', 'B020_3': '非金属材料', 'B020_4': '复合材料', 'B020_5': '功能材料',
        'B020_6': '耐高温材料、耐低温材料', 'B020_7': '耐腐蚀材料', 'B020_8': '智能材料', 'B020_9': '特种结构材料',
        'B020_A': '仿生材料', 'B020_B': '超导材料', 'B020_C': '其他材料',
        'B021_1': '总论', 'B021_2': '矿山测量与勘测工程学', 'B021_3': '矿山开采工程学', 'B021_4': '矿山运输与设备',
        'B021_5': '矿山安全与劳动保护', 'B021_6': '矿山电工', 'B021_7': '选矿', 'B021_8': '矿业工程三废处理及矿产综合利用',
        'B022_1': '金属学总论', 'B022_2': '合金学与各种性质合金', 'B022_3': '金属材料', 'B022_4': '热处理',
        'B022_5': '金属腐蚀与保护、金属表面处理', 'B022_6': '铸造', 'B022_7': '金属压力加工', 'B022_8': '焊接、金属切割及金属粘接',
        'B022_9': '金属切削加工及机床', 'B022_A': '刀具、磨料、磨具、夹具、模具、手工具', 'B022_B': '公差与技术测量及机械量仪',
        'B022_C': '钳工工艺与装配工艺',
        'B023_1': '冶金工艺总论', 'B023_2': '冶金工业经济', 'B023_3': '冶金一般性问题', 'B023_4': '冶金技术',
        'B023_5': '冶金机械、冶金生产自动化', 'B023_6': '钢铁冶炼(黑色金属冶炼)(总论)', 'B023_7': '炼铁',
        'B023_8': '铁合金冶炼', 'B023_9': '炼钢', 'B023_A': '其他黑色金属冶炼', 'B023_B': '有色金属冶炼',
        'B024_1': '概述', 'B024_2': '纺织工业、染整工业', 'B024_3': '食品工业', 'B024_4': '制盐工业', 'B024_5': '烟草工业',
        'B024_6': '皮革工业', 'B024_7': '木材加工工业、家具制造工业', 'B024_8': '造纸工业', 'B024_9': '印刷工业',
        'B024_A': '五金制品工业', 'B024_B': '工艺美术制品工业', 'B024_C': '服装工业、制鞋工业', 'B024_D': '其他轻工业、手工业',
        'B024_E': '轻工业废物处理与综合利用',
        'B025_1': '美食学', 'B025_2': '烹饪法、食谱、菜谱', 'B025_3': '饮食设备及管理', 'B025_4': '洗染、缝补',
        'B025_5': '美容、沐浴、清洁', 'B025_6': '居住管理', 'B025_7': '家庭管理、家庭生活、家庭服务',
        'B026_1': '总论', 'B026_2': '劳动保护基础理论', 'B026_3': '劳动保护管理', 'B026_4': '安全工程', 'B026_5': '劳动卫生工程',
        'B026_6': '灾害及其防治',
        'B027_1': '环境科学', 'B027_2': '社会与环境', 'B027_3': '环境保护管理', 'B027_4': '环境污染及其防治',
        'B027_5': '废物处理与综合利用', 'B027_6': '环境质量评价与环境监测',
        'C028_1': '工程基础科学', 'C028_2': '工程设计与测绘', 'C028_3': '工业通用技术与设备', 'C028_4': '声学工程',
        'C028_5': '制冷工程', 'C028_6': '真空技术', 'C028_7': '摄影技术', 'C028_8': '计量学', 'C028_9': '工业技术概论',
        'C029_1': '机械工业总论', 'C029_2': '机械工业经济', 'C029_3': '机械学', 'C029_4': '机械设计、计算与制图',
        'C029_5': '机械零件及传动装置', 'C029_6': '机械制造用材料', 'C029_7': '机械制造工艺', 'C029_8': '机械运行与维修',
        'C029_9': '机械工厂(车间)', 'C029_A': '起重机械与运输机械', 'C029_B': '泵', 'C029_C': '气体压缩与输送机械',
        'C029_D': '专用机械与设备',
        'C030_1': '仪器、仪表概论', 'C030_2': '一般性问题', 'C030_3': '计量仪器', 'C030_4': '坐标器、计算机具、计数器',
        'C030_5': '物理学与力学一般仪器', 'C030_6': '光学仪器', 'C030_7': '天文仪器', 'C030_8': '地球科学仪器',
        'C030_9': '医药卫生器械', 'C030_A': '生物科学与农林科学仪器', 'C030_B': '热工量的测量仪表', 'C030_C': '力学量测量仪表',
        'C030_D': '成分分析仪器', 'C030_E': '质谱仪', 'C030_F': '显示仪表', 'C030_G': '工业自动化仪表', 'C030_H': '材料试验机与试验仪器',
        'C030_I': '其他仪器仪表',
        'C031_1': '航空、航天技术的研究与探索', 'C031_2': '航空', 'C031_3': '航天', 'C031_4': '航空、航天医学',
        'C032_1': '基础科学', 'C032_2': '武器军用器材', 'C032_3': '军事通讯', 'C032_4': '军事工程', 'C032_5': '军事地形学、军事地理学',
        'C033_1': '铁路运输经济', 'C033_2': '铁路线路工程', 'C033_3': '电气化铁路', 'C033_4': '特种铁路', 'C033_5': '机车工程',
        'C033_6': '车辆工程', 'C033_7': '铁路通信、信号', 'C033_8': '铁路运输管理工程',
        'C034_1': '综合运输', 'C034_2': '公路运输', 'C034_3': '水路运输',
        'C035_1': '汽车工业经济', 'C035_2': '汽车理论', 'C035_3': '整车设计与计算', 'C035_4': '汽车结构部件',
        'C035_5': '汽车发动机', 'C035_6': '汽车材料', 'C035_7': '汽车制造工艺', 'C035_8': '汽车试验', 'C035_9': '汽车制造厂',
        'C035_A': '各种汽车', 'C035_B': '汽车驾驶与使用', 'C035_C': '汽车保养与修理', 'C035_D': '汽车用燃料、润滑料',
        'C035_E': '其它道路运输工具',
        'C036_1': '船舶工业经济', 'C036_2': '船舶原理', 'C036_3': '船舶设计', 'C036_4': '船舶结构', 'C036_5': '船舶机械',
        'C036_6': '船舶电气设备、观通设备', 'C036_7': '导航设备、水声设备', 'C036_8': '船舶舾装设备', 'C036_9': '造船材料',
        'C036_A': '船舶建造工艺', 'C036_B': '船舶保养、修理和拆船工艺', 'C036_C': '造船厂、修船厂', 'C036_D': '各种船舶',
        'C036_E': '船舶驾驶、航海学', 'C036_F': '航海技术管理与救助打捞', 'C036_G': '船舶用燃料及润滑剂',
        'C037_1': '水利经济', 'C037_2': '水利工程基础学', 'C037_3': '水资源调查与水利规划、水工勘测设计',
        'C037_4': '水工结构', 'C037_5': '水工材料', 'C037_6': '水利工程施工', 'C037_7': '水利枢纽、水工建筑物',
        'C037_8': '水能利用、水电站工程', 'C037_9': '治河工程与防洪工程', 'C037_A': '运渠(运河、渠道)工程、港湾工程、农田水利工程',
        'C038_1': '建筑基础科学', 'C038_2': '建筑工程', 'C038_3': '区域规划、城乡规划',
        'C039_1': '动力工业经济', 'C039_2': '一般性问题', 'C039_3': '热力工程、热机', 'C039_4': '蒸汽动力工程',
        'C039_5': '热工量测和热工自动控制', 'C039_6': '内燃机', 'C039_7': '水能、水力机械',
        'C040_1': '原子能技术经济', 'C040_2': '原子能技术及基础理论', 'C040_3': '核燃料及其生产', 'C040_4': '核反应堆工程、核电厂',
        'C040_5': '加速器', 'C040_6': '核爆炸、放射性物质', 'C040_7': '受控热核反应', 'C040_8': '辐射防护',
        'C040_9': '粒子探测技术、辐射探测技术与核仪器仪表',
        'C041_1': '太阳能', 'C041_2': '风能', 'C041_3': '生物质能', 'C041_4': '地热能', 'C041_5': '海洋能',
        'C041_6': '化学能', 'C041_7': '天然气水合物', 'C041_8': '原子能',
        'C042_1': '电力工业概况', 'C042_2': '一般性问题', 'C042_3': '电工基础理论', 'C042_4': '电工材料', 'C042_5': '电机',
        'C042_6': '变压器、变流器及其它电力变换器', 'C042_7': '电器', 'C042_8': '发电、发电厂', 'C042_9': '输配电工程、电力网及电力系统',
        'C042_A': '高电压技术', 'C042_B': '电源技术', 'C042_C': '电气化 、电能应用', 'C042_D': '电气测量技术及仪器',
        'D043_1': '农业基本问题', 'D043_2': '农业方针政策及其阐述', 'D043_3': '农业数学', 'D043_4': '农业物理学',
        'D043_5': '肥料学', 'D043_6': '土壤学', 'D043_7': '农业气象学', 'D043_8': '农业生物学', 'D043_9': '农业资源及环境保护',
        'D044_1': '农业工程总论', 'D044_2': '农业动力、农村能源', 'D044_3': '农业机械及农具', 'D044_4': '农业机械化',
        'D044_5': '农业电气化与自动化、农业航空', 'D044_6': '农业建筑', 'D044_7': '农田水利及水污染防治',
        'D044_8': '农田基本建设、农垦', 'D044_9': '农业工程勘测、土地测量、土地管理、规划及利用',
        'D045_1': '作物生物学原理和栽培技术与方法', 'D045_2': '作物品种与种质资源', 'D045_3': '作物遗传育种与良种繁育',
        'D045_4': '耕作学与有机农业', 'D045_5': '播种、栽植与田间管理', 'D045_6': '农业化学与肥料学', 'D045_7': '土壤学',
        'D045_8': '农产品收获、加工、贮藏及综合利用',
        'D046_1': '植物保护总论', 'D046_2': '动植物检疫', 'D046_3': '植物检疫', 'D046_4': '气象灾害、森林火灾及其预防',
        'D046_5': '作物病虫害及其防治', 'D046_6': '园艺作物病虫害及其防治', 'D046_7': '森林病虫害及其防治',
        'D046_8': '鸟兽害及其它灾害防治', 'D046_9': '有害植物及其清除', 'D046_A': '各种防治方法', 'D046_B': '农药防治(化学防治)',
        'D046_C': '植物保护机械',
        'D047_1': '作物学基础', 'D047_2': '禾谷类作物', 'D047_3': '豆类作物', 'D047_4': '薯类作物', 'D047_5': '饲料作物、牧草',
        'D047_6': '绿肥作物', 'D047_7': '经济作物', 'D047_8': '野生植物、热带、亚热带作物及其它',
        'D048_1': '一般性问题', 'D048_2': '设施园艺', 'D048_3': '蔬菜园艺', 'D048_4': '瓜果园艺', 'D048_5': '果树园艺',
        'D048_6': '观赏园艺(花卉和观赏树木)', 'D048_7': '病虫害及其防治',
        'D049_1': '林业基础科学', 'D049_2': '造林学、林木育种及造林技术', 'D049_3': '绿化建设', 'D049_4': '森林经营学、森林计测学、森林经理学',
        'D049_5': '森林保护学', 'D049_6': '森林工程、林业机械', 'D049_7': '森林采运与利用', 'D049_8': '森林树种',
        'D050_1': '普通畜牧学', 'D050_2': '家畜', 'D050_3': '家禽', 'D050_4': '兽医学',
        'D051_1': '狩猎、野生动物驯养', 'D051_2': '畜禽产品的综合利用', 'D051_3': '蚕桑、养蜂、益虫饲养',
        'D052_1': '水产经济', 'D052_2': '水产基础科学', 'D052_3': '水产地区分布、水产志与资源', 'D052_4': '水产保护学',
        'D052_5': '水产工程', 'D052_6': '水产养殖技术', 'D052_7': '渔捞', 'D052_8': '水产物运输、保鲜贮藏、加工、包装',
        'E053_1': '卫生事业总论', 'E053_2': '医药、卫生政策法规', 'E053_3': '医疗保险', 'E053_4': '医务人员及卫生宣传教育',
        'E053_5': '卫生标准与检查、医药管理', 'E053_6': '卫生调查统计', 'E053_7': '医疗服务、制度及改革', 'E053_8': '医疗与法',
        'E053_9': '医疗卫生机构及管理', 'E053_A': '医疗器械',
        'E054_1': '一般理论、现状与发展', 'E054_2': '循证医学', 'E054_3': '医学教育', 'E054_4': '医学与其他学科的关系',
        'E054_5': '医学史', 'E054_6': '医学图书情报及相关机构、团体、会议',
        'E055_0': '总论', 'E055_1': '卫生基础科学', 'E055_2': '环境卫生', 'E055_3': '劳动卫生', 'E055_4': '放射卫生',
        'E055_5': '营养卫生食品卫生', 'E055_6': '个人卫生与保健', 'E055_7': '计划生育与妇幼保健', 'E055_8': '流行病学与防疫',
        'E056_1': '中国医学', 'E056_2': '中医基础理论', 'E056_3': '中医临床学', 'E056_4': '中医内科', 'E056_5': '中医外科',
        'E056_6': '中医骨伤科', 'E056_7': '中医妇产科', 'E056_8': '中医儿科', 'E056_9': '中医肿瘤科', 'E056_A': '中医皮科',
        'E056_B': '中医五官科', 'E056_C': '中医泌尿学', 'E056_D': '中医神经病学与精神病学', 'E056_E': '中医急症学',
        'E056_F': '中国少数民族医学', 'E056_G': '外国民族医学',
        'E057_1': '总论', 'E057_2': '本草', 'E057_3': '中药材', 'E057_4': '中药炮制、制剂', 'E057_5': '中药化学',
        'E057_6': '中药药理学', 'E057_7': '中药品', 'E057_8': '各科用药', 'E057_9': '中药药事组织', 'E057_A': '方剂学',
        'E057_B': '其他各国生药学',
        'E058_1': '中西医结合基础', 'E058_2': '中西医结合临床',
        'E059_1': '实验医学', 'E059_2': '医用一般科学（医用数学、物理学、化学等）', 'E059_3': '人体形态学',
        'E059_4': '人体生理学', 'E059_5': '医学生物化学与分子生物学', 'E059_6': '医学生物物理学', 'E059_7': '病理学',
        'E059_8': '医学微生物学', 'E059_9': '医学寄生虫学', 'E059_A': '医学免疫学', 'E059_B': '医学遗传学',
        'E059_C': '医学心理学、病理心理学',
        'E060_1': '临床医学总论', 'E060_2': '诊断与治疗技术', 'E060_3': '护理学', 'E060_4': '吸毒与戒毒', 'E060_5': '疼痛医学',
        'E060_6': '睡眠医学', 'E060_7': '康复医学', 'E060_8': '临终关怀学', 'E060_9': '其他诊疗技术',
        'E061_1': '感染性疾病的预防', 'E061_2': '感染性疾病总论', 'E061_3': '病毒传染病', 'E061_4': '立克次体传染病',
        'E061_5': '螺旋体传染病', ' E061_6': '细菌感染性疾病', 'E061_7': '衣原体、支原体属疾病', 'E061_8': '真菌、放线菌传染病',
        'E061_9': '结核病', 'E061_A': '寄生虫病', 'E061_B': '其他感染性疾病',
        'E062_1': '总论', 'E062_2': '诊断学', 'E062_3': '心脏疾病', 'E062_4': '血管疾病', 'E062_6': '血压异常',
        'E062_7': '血液及淋巴系疾病',
        'E063_1': '总论', 'E063_2': '胸膜及胸腔疾病', 'E063_3': '气管与支气管疾病', 'E063_4': '肺疾病', 'E063_5': '纵隔疾病',
        'E063_6': '膈疾病',
        'E064_1': '总论', 'E064_2': '食管疾病', 'E064_3': '腹部疾病', 'E064_4': '胃疾病', 'E064_5': '肠疾病', 'E064_6': '肝及胆疾病',
        'E064_7': '胰腺疾病',
        'E065_1': '内分泌腺疾病及代谢病', 'E065_2': '全身性疾病',
        'E066_1': '外科学总论', 'E066_2': '外科学基础', 'E066_3': '外科手术学', 'E066_4': '外科感染', 'E066_5': '创伤外科学',
        'E066_6': '外科学各论', 'E066_7': '骨科学', 'E066_8': '整形外科学',
        'E067_1': '一般疾病', 'E067_2': '肾疾病', 'E067_3': '输尿管疾病', 'E067_4': '膀胱疾病', 'E067_5': '尿的成分异常',
        'E067_6': '尿道疾病', 'E067_7': '男性生殖器疾病', 'E067_8': '男子性功能障碍', 'E067_9': '泌尿及男性生殖系外科学',
        'E068_1': '基础与临床', 'E068_2': '妇科学', 'E068_3': '产科学', 'E068_4': '计划生育', 'E068_5': '临床优生学',
        'E068_6': '辅助生殖技术',
        'E069_1': '新生儿、早产儿疾病', 'E069_2': '儿童的营养障碍及保健与卫生', 'E069_3': '小儿内科学', 'E069_4': '小儿外科学',
        'E069_5': '小儿泌尿科学', 'E069_6': '儿童神经、精神病', 'E069_7': '小儿其他疾病', 'E069_8': '中医儿科', 'E069_9': '其他',
        'E070_1': '基础与临床', 'E070_2': '脑部疾病', 'E070_3': '脑血管疾病', 'E070_4': '脊髓疾病', 'E070_5': '周围神经及神经节疾病',
        'E070_6': '神经肌肉疾病', 'E070_7': '植物性神经系疾病、血管舒缩及营养神经系疾病', 'E070_8': '并发神经病',
        'E070_9': '神经系肿瘤', 'E070_A': '儿童神经病',
        'E071_1': '基础与临床', 'E071_2': '器质性疾病伴发的精神障碍', 'E071_3': '精神分裂症', 'E071_4': '情感性精神障碍',
        'E071_5': '反应性及中毒所致精神障碍', 'E071_6': '神经官能症', 'E071_7': '其他',
        'E072_1': '肿瘤学基础', 'E072_2': '心血管肿瘤', 'E072_3': '造血器及淋巴系肿瘤', 'E072_4': '呼吸系肿瘤',
        'E072_5': '消化系肿瘤', 'E072_6': '内分泌腺肿瘤', 'E072_7': '泌尿生殖器肿瘤', 'E072_8': '乳腺肿瘤', 'E072_9': '运动系肿瘤',
        'E072_A': '神经系肿瘤', 'E072_B': '皮肤肿瘤', 'E072_C': '五官肿瘤', 'E072_D': '其他部位肿瘤',
        'E073_1': '总论', 'E073_2': '耳科学、耳疾病', 'E073_3': '鼻科学、鼻疾病', 'E073_4': '咽科学、咽疾病', 'E073_5': '喉科学、喉疾病',
        'E073_6': '气管与食管镜学', 'E073_8': '眼科学',
        'E074_1': '基础与临床', 'E074_2': '口腔内科学', 'E074_3': '口腔颌面部外科学', 'E074_4': '口腔矫形学', 'E074_5': '老年口腔疾病',
        'E074_6': '儿童口腔疾病',
        'E075_1': '皮肤病学', 'E075_2': '性病学',
        'E076_1': '放射医学', 'E076_2': '军事医学', 'E076_3': '航海医学', 'E076_4': '潜水医学', 'E076_5': '航空、航天医学',
        'E076_6': '运动医学', 'E076_7': '法医学',
        'E077_1': '总论及基础研究', 'E077_2': '急重症治疗技术', 'E077_3': '急重症各论',
        'E078_1': '军事医学卫生', 'E078_2': '航海医学', 'E078_3': '潜水医学', 'E078_4': '航空、航天医学',
        'E079_1': '总论', 'E079_2': '药物基础科学', 'E079_3': '药典、药方集及药物鉴定', 'E079_4': '药剂学', 'E079_5': '药事组织',
        'E079_6': '药理学', 'E079_7': '药品', 'E079_8': '毒物学(毒理学)',
        'E080_1': '一般性问题', 'E080_2': '基础理论(医用一般科学）', 'E080_3': '生物学', 'E080_4': '医用仿生学',
        'E080_5': '生物材料及人工器官', 'E080_6': '光、激光生物医学', 'E080_7': '电及影像技术在生物医学中的应用',
        'E080_8': '航空、航天医学工程', 'E080_9': '其他科学技术在医学上的应用', 'E080_A': '仪器设备',
        'F081_1': '文学理论综述', 'F081_2': '文艺美学', 'F081_3': '文学理论的基本问题', 'F081_4': '文艺工作者',
        'F081_5': '文学写作与文学创作方法', 'F081_6': '各体文学理论和创作方法', 'F081_7': '艺术理论', 'F081_8': '世界各国艺术概况',
        'F082_1': '作品评论和研究', 'F082_2': '文学史、文学思想史', 'F082_3': '作品集', 'F082_4': '各国文学',
        'F083_1': '方针政策及阐述', 'F083_2': '文学评论和研究', 'F083_3': '文学史、文学思想史', 'F083_4': '鲁迅作品及其研究',
        'F083_5': '诗歌、韵文', 'F083_6': '戏剧文学', 'F083_7': '小说', 'F083_8': '报告文学', 'F083_9': '散文', 'F083_A': '民间文学',
        'F083_B': '儿童文学', 'F083_C': '少数民族文学',
        
    }
    firstrun = True
    if subsubstart == '':
        firstrun = False
    pagedatadir = './pagedata'
    filedatadir = './filedata'
    os.makedirs(pagedatadir, exist_ok=True)
    os.makedirs(filedatadir, exist_ok=True)
    driver.switch_to.window(driver.window_handles[0])
    driver.switch_to.default_content()
    driver.get('http://kns.cnki.net/kns/brief/result.aspx?dbprefix=CJFQ')
    driver.maximize_window()
    # 检索按钮

    # 选择学校
    collage_input = driver.find_element_by_id('au_1_value2')
    driver.execute_script('arguments[0].value = arguments[1]', collage_input, collage_name)

    # 选择年份
    time.sleep(2)
    yearfrom = driver.find_element_by_name('year_from')
    yearfrom.send_keys('{0}'.format(year_start))
    time.sleep(2)
    yearto = driver.find_element_by_name('year_to')
    yearto.send_keys('{0}'.format(year_end))
    time.sleep(2)

    # 选择来源
    journalsource = driver.find_element_by_id('ddSubmit').find_elements_by_class_name('dd01')[3]
    jsall = journalsource.find_element_by_id('AllmediaBox')
    if jsall.is_selected():
        jsall.click()
    jsbox = journalsource.find_elements_by_tag_name('input')[2:]
    jsbox[3].click()
    jsbox[4].click()
    time.sleep(2)

    # 选择类别
    sub_id_list = dict()
    bigsub_list = np.unique([x[0] for x in subject_id_list])
    # 区分大的类别
    for bigsub in bigsub_list:
        sub_id_list[bigsub] = [x for x in subject_id_list if x[0] == bigsub]
    clear_btn = driver.find_element_by_id('XuekeNavi_Div').find_elements_by_class_name('btn')[0]
    clear_btn.click()

    for bigsub in sub_id_list:
        category = driver.find_element_by_id('XuekeNavi_Div').find_element_by_id(bigsub).find_element_by_id(bigsub + 'first')
        category.click()
        time.sleep(1)

        for subid in sub_id_list[bigsub]:
            subcategorydlfirst = WebDriverWait(driver, 6).until(
                EC.presence_of_element_located((By.ID, subid + 'first'))
            )
            # subcategorydlfirst = driver.find_element_by_id(subid + 'first')
            subcategorydlfirst.click()  # open subsubcategory list
            time.sleep(1)
            subsubcategorys = driver.find_element_by_id(subid + 'child').find_elements_by_id('selectbox')

            for subsub in subsubcategorys:
                subsubid = subsub.get_property('value')
                # 跳过不需要跑的 subsub
                if firstrun & (subsubid != subsubstart):
                    continue
                firstrun = False

                pagefilename = '{0}_{1}_{2}_{3}_{4}.txt'.format(
                    collage_name, subsubid,
                    subsubject_name[subsubid],
                    str(year_start), str(year_end)
                )
                subsub.click()
                time.sleep(2)
                searchbtn = driver.find_element_by_id('btnSearch')
                searchbtn.click()  # 搜索  ShowDiv0
                time.sleep(2)
                WebDriverWait(driver, 6).until(
                    EC.presence_of_element_located((By.ID, 'Show0'))
                )
                result_number = int(get_search_result_number(driver))
                if result_number > 6000:
                    raise ValueError(
                        ' '.join([collage_name, subsubid, '搜索结果超出限额：', get_search_result_number(driver)])
                    )
                elif result_number == 0:
                    with open(
                            os.path.join(
                                pagedatadir,
                                pagefilename
                            ),
                            'ab'
                    ) as f:
                        f.write('zero result\n'.encode('utf-8'))
                else:
                    while True:
                        checkcode(driver)
                        tabletext = get_info(driver)
                        tabletext[0] = '科目\t' + tabletext[0]
                        for row in range(1, len(tabletext)):
                            tabletext[row] = '\t'.join([subsubid, tabletext[row]])
                        with open(
                                os.path.join(
                                    pagedatadir,
                                    pagefilename
                                ),
                                'ab'
                        ) as f:
                            f.write('\n'.join(tabletext[1:]).encode('utf-8'))
                            f.write('\n'.encode('utf-8'))
                        clear_items(driver)
                        select_items(driver)
                        export_items(driver, 2)
                        time.sleep(1)
                        filename = max(
                            [os.path.join(filedatadir, f) for f in os.listdir(filedatadir)],
                            key=os.path.getctime
                        ) # 获取创建最晚的文件
                        for fi in range(60):
                            newfilename = '{0}_{1}_{2}_{3}_{4}_{5}.xls'.format(
                                collage_name, subsubid, subsubject_name[subsubid], year_start, year_end, fi
                            )
                            if not os.path.exists(os.path.join(filedatadir, newfilename)):
                                shutil.move(filename, os.path.join(filedatadir, newfilename))
                                break
                        clear_items(driver)
                        time.sleep(random.randint(2, 5))
                        if not next_page(driver):
                            break
                subsub.click()
            time.sleep(1)
            subcategorydlsecond = WebDriverWait(driver, 5).until(
                EC.presence_of_element_located((By.ID, subid + 'second'))
            )
            subcategorydlsecond.click()  # close subsubcategory list





###########################################


subject_name = {
    'A001': '自然科学理论与方法', 'A002': '数学', 'A003': '非线性科学与系统科学', 'A004': '力学',
    'A005': '物理学', 'A006': '生物学', 'A007': '天文学', 'A008': '自然地理学和测绘学', 'A009': '气象学',
    'A010': '海洋学', 'A011': '地质学', 'A012': '地球物理学', 'A013': '资源科学',
}
subsubject_name = {
    'A001_1': '自然科学研究的方针政策', 'A001_2': '自然科学理论与方法论', 'A001_3': '自然科学现状及发展',
    'A001_4': '自然科学研究及自然科学史',
    'A002_1': '数学概论', 'A002_2': '古典数学', 'A002_3': '初、高等数学',
    'A002_4': '数理逻辑、数学基础', 'A002_5': '代数、数论、组合理论', 'A002_6': '数学分析',
    'A002_7': '几何、拓扑', 'A002_8': '动力系统理论', 'A002_9': '概率论 、数理统计', 'A002_A': '运筹学',
    'A002_B': '控制论、信息论(数学理论)', 'A002_C': '计算数学', 'A002_D': '应用数学',
    'A003_1': '非线性科学', 'A003_2': '系统科学',
    'A004_1': '力学概论', 'A004_2': '理论力学(一般力学)', 'A004_3': '振动理论', 'A004_4': '连续介质力学(变形体力学)',
    'A004_5': '固体力学', 'A004_6': '流体力学', 'A004_7': '流变学', 'A004_8': '爆炸力学', 'A004_9': '应用力学',
    'A005_1': '物理学总论', 'A005_2': '物理学现状、概况', 'A005_3': '物理学实验方法与设备', 'A005_4': '物理测量',
    'A005_5': '理论物理学', 'A005_6': '声学', 'A005_7': '光学', 'A005_8': '电磁学、电动力学', 'A005_9': '无线电物理学',
    'A005_A': '真空电子学(电子物理学)', 'A005_B': '半导体物理学', 'A005_C': '固体物理学', 'A005_D': '低温物理学',
    'A005_E': '高压与高温物理学', 'A005_F': '等离子体物理学', 'A005_G': '热学与物质分子运动论',
    'A005_H': '分子物理学、原子物理学', 'A005_I': '原子核物理学、高能物理学', 'A005_J': '应用物理学',
    'A006_1': '生物科学总论', 'A006_2': '普通生物学', 'A006_3': '细胞学', 'A006_4': '遗传学', 'A006_5': '生理学',
    'A006_6': '生物化学', 'A006_7': '生物物理学', 'A006_8': '分子生物学及遗传工程', 'A006_9': '生物工程学',
    'A006_A': '环境生物学', 'A006_B': '古生物学', 'A006_C': '微生物学理论及其应用', 'A006_D': '植物学',
    'A006_E': '动物学', 'A006_F': '昆虫学', 'A006_G': '人类学',
    'A007_1': '一般性问题', 'A007_2': '天文观测设备与观测资料', 'A007_3': '天体测量学', 'A007_4': '天体力学(理论天文学)',
    'A007_5': '天体物理学', 'A007_6': '恒星天文学、星系天文学、宇宙学', 'A007_7': '射电天文学(无线电天文学)',
    'A007_8': '空间天文学', 'A007_9': '太阳系', 'A007_A': '时间、历法',
    'A008_1': '自然地理学', 'A008_2': '测绘学',
    'A009_1': '气象工作及气象经济', 'A009_2': '气象基础科学', 'A009_3': '大气探测(气象观测)', 'A009_4': '气象要素及大气现象',
    'A009_5': '动力气象学', 'A009_6': '天气学', 'A009_7': '天气预报', 'A009_8': '气候学', 'A009_9': '气象灾害学',
    'A009_A': '应用气象学', 'A009_B': '气象设备仪器制造、使用', 'A009_C': '人工影响天气',
    'A010_1': '海洋学', 'A010_2': '海洋调查技术方法与设备', 'A010_3': '区域海洋学', 'A010_4': '海洋气象学',
    'A010_5': '海洋水文学', 'A010_6': '海洋物理学', 'A010_7': '海洋化学', 'A010_8': '海洋生物学', 'A010_9': '海洋地球物理学',
    'A010_A': '海洋地质学、海洋地貌学', 'A010_B': '海洋资源与开发', 'A010_C': '海洋工程', 'A010_D': '海洋环境及海洋保护学',
    'A010_E': '海洋灾害',
    'A011_1': '地质工作及地质经济', 'A011_2': '地质灾害及灾害地质学', 'A011_3': '矿物学', 'A011_4': '岩石学',
    'A011_5': '古生物学', 'A011_6': '历史地质学、地层学', 'A011_7': '动力地质学', 'A011_8': '构造地质学',
    'A011_9': '地质力学', 'A011_A': '区域地质学', 'A011_B': '矿床学', 'A011_C': '地球化学', 'A011_D': '普查勘探地质学',
    'A011_E': '勘探工程学', 'A011_F': '宇宙地质学', 'A011_G': '海洋地质学', 'A011_H': '水文地质学与工程地质学',
    'A011_I': '环境地质学', 'A011_K': '地质勘查仪器及设备',
    'A012_1': '一般理论', 'A012_2': '地球起源及演化', 'A012_3': '地球形状学及地球结构', 'A012_4': '地球重力学',
    'A012_5': '大地构造物理学、岩组学(构造岩石学)', 'A012_6': '地热学、火山学', 'A012_7': '地磁学',
    'A012_8': '地电学', 'A012_9': '水文学', 'A012_A': '空间物理', 'A012_B': '地震地球物理学', 'A012_C': '勘查地球物理学',
    'A012_D': '海洋地球物理学', 'A012_E': '工程及水文地球物理勘探', 'A012_F': '地球物理勘测仪器',
    'A013_1': '资源管理与利用', 'A013_2': '各种资源的开发与利用'
}



profile = webdriver.FirefoxProfile()
profile.set_preference('browser.download.folderList', 2)
profile.set_preference('browser.download.dir', os.path.join(os.getcwd(), 'filedata'))
profile.set_preference('browser.download.manager.showWhenStarting', False)
profile.set_preference('browser.helperApps.neverAsk.saveToDisk', 'application/x--tagged; charset=utf-8')
driver = webdriver.Firefox(firefox_profile=profile, executable_path=r'./geckodriver.exe')


crawler('北京理工大学', 2011, 2017, ['A' + '{0:03d}'.format(x) for x in range(5, 14)], 'A005_C')

